Repository: MonoBrasil/historico
Catalog: Apresentacoes/2012/exemplos/LiveCD0.2/Aplicativos/monouml-0.1/po/*.po
Languages: es

source: _Project
es: _Proyecto

source: Create new project
es: Crear nuevo proyecto

source: _New
es: _Nuevo

source: _Insert
es: _Insertar

source: Insert new UML element
es: Insertar nuevo elemento UML

source: New _UML element...
es: Nuevo elemento _UML...

source: Insert new UML diagram
es: Insertar nuevo diagrama UML

source: New UML diagram...
es: Nuevo diagrama UML...

source: _Tools
es: _Herramientas

source: Generate code from UML models
es: Generar código desde modelos UML

source: _Code Generation
es: Generación de código

source: Import models from .NET files
es: Importar modelos desde archivos de .NET

source: _Reverse Engineering
es: Ingeniería Inversa

source: Import models and diagrams from other tools
es: Importar modelos y diagramas desde otras herramientas

source: _Import
es: _Importar

source: New solution
es: Nueva solución

source: Open solution
es: Abrir solución

source: Save current solution
es: Guardar solución actual

source: Save solution as
es: Guardar solución como

source: Show _grid
es: Mostrar grilla

source: _Snap to grid
es: Ajustar a la grilla

source: <b>Diagram aspect</b>
es: <b>Aspecto del diagrama</b>

source: _Use default values
es: _Usar valores por defecto

source: Grid _color:
es: Color de _Grilla

source: _Font color:
es: Color de _Fuente

source: <b>Colors</b>
es: <b>Colores</b>

source: _Default values
es: Valores por _defecto

source: You are running a MonoUML development version. This version MIGHT HAVE bugs, if have found any please report it to our bugzilla site: http://bugzilla.monouml.org Any help is very appreciated. More information in the mailing list.If you want to test, there are some samples in the 'samples/' directory. Regards ---- MonoUML Team.
es: Usted esta ejecutando una versión de desarrollo de MonoUML. Esta versión PODRÍA TENER errores; si usted encuentra alguno, por favor repórtelo en nuestro sitio bugzilla: http://bugzilla.monouml.org Cualquier ayuda es muy bien recibida. Más información en la lista de correo. Si desea hacer pruebas, en el directorio samples/ encontrará algunos ejemplos. Saludos ---- Equipo MonoUML

source: UML Properties
es: Propiedades UML

source: Select a model or diagram file
es: Seleccione un modelo o archivo de diagrama

source: XMI files
es: Archivos XMI

source: Argo files
es: Archivos Argo

source: Poseidon files
es: Archivos Poseidon

source: The CASE tool for Mono (SVN pre-alpha version)
es: Herramienta CASE para MONO (version SVN pre-alfa)

source: Help us by translating to your native language.
es: Ayúdenos traduciendo a su lenguaje nativo.

source: Select project
es: Seleccione un proyecto

source: Select some option from the icon list.
es: Seleccione una opción de la lista de iconos.

source: New Project
es: Nuevo Proyecto

source: Open Project
es: Abrir Proyecto

source: From other format
es: Desde otro formato

source: From Reverse Engineering
es: Desde Ingeniería Inversa

source: Code generation
es: Generación de código

source: Code Generation
es: Generación de Código

source: In the following pages you will be able to create source code from the UML model. Click Forward to continue
es: En las siguientes páginas usted podrá crear código fuente a partir del modelo UML. Presione siguiente para continuar

source: Start code generation
es: Iniciar la generación de código

source: Click Apply to proceed the code generation, when finished a dialog window will pop up.
es: Presione Aplicar para iniciar la generación de código. Cuando finalice, una ventana emergente aparecerá.

source: Required values
es: Valores requeridos

source: Available code generators
es: Generadores de código disponibles

source: Select a model processor
es: Seleccione un procesador de modelos

source: Your code couldn't be generated:
es: Su código no pudo ser generado.

source: Try again.
es: Intente de nuevo.

source: Code generation done.
es: Generación de código finalizada.

source: No dlls found
es: No se encontraron dlls

source: You don't have any code-generation assembly. Remember that you must create a folder called 'generators/' where all the assemblies must exist, try again.
es: Usted no tiene algún ensamblado de generación de código. Recuerde que debe crear un directorio llamado 'generators/' donde todos los ensamblados deben residir. Intente de nuevo.

source: Please select the programming language for generating your code
es: Por favor seleccione el lenguaje de programación para la generación del código

source: Please fill the required value
es: Por favor rellene todos los campos requeridos

source: Reverse Engineering
es: Ingeniería Reversa

source: In the following pages you will be able to import .NET assemblies and then build its UML model. Click Forward to continue
es: En las siguientes páginas usted podrá importar ensamblados de .NET y construir su correspondiente modelo UML. Presione Siguiente para continuar

source: Start reverse engineering
es: Comenzar la ingeniería inversa

source: Click Apply to proceed the reverse engineering, when finished a dialog window will pop up.
es: Presione Aplicar para iniciar la ingeniería inversa; cuando finalice, una ventana emergente aparecerá.

source: Add assemblies for importing
es: Agregue ensamblados para importar

source: Select importing level
es: Seleccione el nivel de importación

source: Import _only elements within assembly.
es: Importar s_olamente elementos del ensamblado

source: F_ull import from assembly.
es: Importación _completa desde el ensamblado

source: Set your importing parameters
es: Establezca sus parámetros de importación

source: Import _public methods
es: Importar métodos _públicos

source: Import p_rivate methods
es: Importar métodos p_rivados

source: Import pr_otected methods
es: Importar métodos pr_otegidos

source: Import public fiel_ds
es: Importar _campos públicos

source: Import private f_ields
es: Importar _campos privados

source: Import protected fi_elds
es: Importar campos protegidos

source: Classes
es: Clases

source: Classes and Interfaces
es: Clases e Interfaces

source: Import _Classes
es: Importar Clases

source: Import _Enumerations
es: Importar Enumeraciones

source: Import _Interfaces
es: Importar Interfaces

source: Import _Structs
es: Importar _Estructuras

source: Import E_vents
es: Importar E_ventos

source: Import _Delegates
es: Importar _Delegados

source: Select your .NET assembly
es: Seleccione su ensamblado .NET

source: .NET Assembly files
es: Archivos de ensamblado .NET

source: .NET Executable files
es: Archivos ejecutable .NET

source: Other files
es: Archivos Argo

source: Filename:
es: Nombre del archivo:

source: is not a .NET assembly:
es: no es un ensamblado .NET:

source: Serializating...
es: Serializando...

source: The Reverse Engineering has finished. Starting to load.
es: La Ingeniería Inversa ha finalizado. Iniciando la carga.

source: Add at least one assembly before proceeding the next step.
es: Agregue al menos un ensamblado antes de proceder con el siguiente paso.

source: Importing...
es: Importando...

source: Please wait while loading...
es: Por favor espere mientras carga..

source: Add an Actor
es: Agregar un actor

source: Add an Use Case
es: Agregar un Caso de Uso

source: Add a class
es: Agregar una clase

source: Show grid
es: Mostrar grilla

source: Snap to grid
es: Ajustar a la grilla

source: Aggregation kind:
es: Tipo de Agregación:

source: none
es: ninguna

source: shared
es: compartida

source: composite
es: compuesta

source: Owned comments:
es: Comentarios propios:

source: <<New comment>>
es: <<Nuevo comentario>>

source: Choose an element
es: Escoja un elemento

source: _Cancel
es: _Cancelar

source: _Accept
es: _Aceptar

source: Choose a diagram type
es: Escoja el tipo de diagrama

source: _Class
es: Clase

source: _Use Case
es: Caso de _Uso

source: Extends:
es: Extiende:

source: Extend #
es: Extensión #

source: Extended case:
es: Caso de uso extendido:

source: Extend condition:
es: Condición de extensión:

source: <<A constraint>>
es: <<Una restricción>>

source: Extension locations:
es: Ubicaciones de las extensiones:

source: Generalizations:
es: Generalizaciones:

source: <<anonymous Generalization>>
es: <<Generalización anónima>>

source: There are no elements in the model; you should create some elements first.
es: No hay elementos en el modelo; primero debe crear algún elemento.

source: Choose a namespace
es: Escoja un espacio de nombres

source: Select your project
es: Seleccione su proyecto.

source: All files
es: Todos los archivos

source: Save your project as
es: Guardar su proyecto como

source: A file named {0} already exists. Do you want to replace it with the one you are saving?
es: Un archivo llamado {0} ya existe. ¿Ustede quiere reemplazarlo con este que esta salvando?

source: New element name:
es: Nuevo nombre de elemento:

source: Contract:
es: Contrato:

source: Includes:
es: Incluye:

source: Include #
es: Inclusión #

source: Close diagram
es: Cerrar diagrama

source: Visibility:
es: Visibilidad:

source: public
es: público

source: private
es: privado

source: protected
es: protegido

source: package
es: paquete

source: Choose elements
es: Escoja elementos

source: anonymous
es: anónimo

source: Owned attributes:
es: Atributos propios:

source: <<New Property>>
es: <<Nueva propiedad>>

source: <<New End>>
es: <<Nuevo Extremo>>

source: Owned operations:
es: Operaciones propias:

source: <<New Operation>>
es: <<Nueva Operación>>

source: Owned types:
es: Tipos propios:

source: Direction:
es: Dirección:

source: return
es: retorna

source: Choose a root-level element
es: Escoja un elemento raíz

source: Model
es: Modelo

source: Package
es: Paquete

source: Profile
es: Perfil

source: Name:
es: Nombre:

source: Abstract:
es: Abstracto:

source: Derived:
es: Derivado:

source: Leaf:
es: Hoja:

source: Query:
es: Consulta:

source: Read only:
es: Sólo lectura:

source: Static:
es: Estático:

source: Extension points:
es: Puntos de extensión:

source: Owned literals:
es: Literales propios:

source: Owned parameters:
es: Parámetros propios:

source: Nested packages:
es: Paquetes anidados:

source: Owned ends:
es: Extremos propios:

source: Member ends:
es: Extremos miembros:

source: Interface Realizations:
es: Implementaciones de interfaz:

source: Package imports:
es: Importaciones de paquete:

source: Element imports:
es: Importaciones de elemento:

source: Owned use cases:
es: Casos de uso propios:

source: Choose a type
es: Escoja un tipo

source: Activity
es: Actividad

source: Artifact
es: Artefacto

source: Association
es: Asociación

source: AssociationClass
es: Clase Asociación

source: Class
es: Clase

source: Collaboration
es: Colaboración

source: CommunicationPath
es: Ruta de Comunicación

source: Component
es: Componente

source: DataType
es: Tipo de Dato

source: DeploymentSpecification
es: Especificación de Despliegue

source: Device
es: Dispositivo

source: Enumeration
es: Enumeración

source: ExecutionEnvironment
es: Entorno de Ejecución

source: Extension
es: Extensión

source: InformationItem
es: Ítem de Información

source: Interaction
es: Interacción

source: Interface
es: Interfaz

source: Node
es: Nodo

source: PrimitiveType
es: Tipo Primitivo

source: ProtocolStateMachine
es: Máquina de Estados de Protocolo

source: Signal
es: Señal

source: StateMachine
es: Máquina de Estados

source: Stereotype
es: Estereotipo

source: UseCase
es: Caso de Uso

source: Type:
es: Tipo:
